/*👉 CommonJS কী?

CommonJS হলো Node.js এর default module system মানে ফাইল ভাগ করে কোড লেখার নিয়ম, যেখানে

module.exports দিয়ে কিছু পাঠানো হয়

require() দিয়ে সেই জিনিস অন্য ফাইলে আনা হয়

এটাই CommonJS।
//////////////////////////////////////////////
👉 CommonJS এর ৩টা keyword:
1) module.exports

তুমি যেটা export করতে চাও—object, function, variable সবই পাঠানো যায়।

2) exports

একই কাজের shorthand কিন্তু ভুল করলে কাজ করবে না।

3) require()

যেটা পাঠানো হয়েছে সেটা নিয়ে আসে বা import এর কাজ করা  ।



///////////////////////////////////////////////////

👉 Name Alias কী?

যখন  কোনো variable, function, object অন্য নামে ব্যবহার করা হয়
এটাকেই Alias বলে।

*/

const { x: a } = require("./file-02");
require("");

console.log(a);
